In [1]:
print('=========================第7章=============数据清洗和准备============================================')

=========================第7章=============数据清洗和准备============================================

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
cleaned = data.dropna()

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[4] = NA

In [25]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = pd.DataFrame(np.random.randn(7, 3))

In [30]:
df

          0         1         2
0 -0.197960       NaN       NaN
1  1.256548       NaN       NaN
2  0.692202       NaN -0.081798
3 -0.896413       NaN -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [31]:
df.iloc[:4, 1] = NA

In [32]:
df.iloc[:2, 2] = NA

In [33]:
df

          0         1         2
0 -0.197960       NaN       NaN
1  1.256548       NaN       NaN
2  0.692202       NaN -0.081798
3 -0.896413       NaN -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [34]:
df.dropna()

          0         1         2
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [35]:
df.dropna(thresh=2)

          0         1         2
2  0.692202       NaN -0.081798
3 -0.896413       NaN -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [36]:
df.fillna(0)

          0         1         2
0 -0.197960  0.000000  0.000000
1  1.256548  0.000000  0.000000
2  0.692202  0.000000 -0.081798
3 -0.896413  0.000000 -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [37]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.197960  0.500000  0.000000
1  1.256548  0.500000  0.000000
2  0.692202  0.500000 -0.081798
3 -0.896413  0.500000 -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [38]:
_ = df.fillna(0, inplace=True)

In [39]:
df

          0         1         2
0 -0.197960  0.000000  0.000000
1  1.256548  0.000000  0.000000
2  0.692202  0.000000 -0.081798
3 -0.896413  0.000000 -0.970474
4 -1.769155 -1.558592  0.747126
5 -0.183836  1.000955 -0.923537
6 -0.082284  0.174279 -1.152584

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))

In [43]:
df

          0         1         2
0  0.231842  1.362466 -0.629166
1  1.491684  0.823851 -0.284775
2 -0.332916 -1.446626 -0.011803
3 -0.809257 -1.142015 -0.026640
4  0.704371  0.817972 -0.057888
5  0.639836 -0.292244  0.292313

In [47]:
df.iloc[2:, 1] = NA

In [48]:
df.iloc[4:, 2] = NA

In [49]:
df

          0         1         2
0  0.231842  1.362466 -0.629166
1  1.491684  0.823851 -0.284775
2 -0.332916       NaN -0.011803
3 -0.809257       NaN -0.026640
4  0.704371       NaN       NaN
5  0.639836       NaN       NaN

In [50]:
df.fillna(method='ffill')

          0         1         2
0  0.231842  1.362466 -0.629166
1  1.491684  0.823851 -0.284775
2 -0.332916  0.823851 -0.011803
3 -0.809257  0.823851 -0.026640
4  0.704371  0.823851 -0.026640
5  0.639836  0.823851 -0.026640

In [51]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.231842  1.362466 -0.629166
1  1.491684  0.823851 -0.284775
2 -0.332916  0.823851 -0.011803
3 -0.809257  0.823851 -0.026640
4  0.704371       NaN -0.026640
5  0.639836       NaN -0.026640

In [52]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [53]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [54]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [55]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [56]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [57]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [61]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [62]:
data['v1'] = range(7)

In [63]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [64]:
# 根据k1列过滤重复值
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [65]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [66]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [67]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [68]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [69]:
lowercased = data['food'].str.lower()

In [70]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [71]:
data['animal'] = lowercased.map(meat_to_animal)

In [72]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [74]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [75]:
data = pd.Series([1., -999., 2., -999., -1000., -3.])

In [76]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5      -3.0
dtype: float64

In [77]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5      -3.0
dtype: float64

In [79]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5   -3.0
dtype: float64

In [80]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5   -3.0
dtype: float64

In [81]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5   -3.0
dtype: float64

In [83]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [84]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
transform = lambda x: x[:4].upper()

In [86]:
transform

In [87]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [88]:
data.index = data.index.map(transform)

In [89]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [90]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [91]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [92]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [93]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [94]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [95]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [96]:
bins = [18, 25, 35, 60, 100]

In [97]:
cats = pd.cut(ages, bins)

In [98]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [99]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [100]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [101]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [102]:
# 圆括号开端，方括号闭端
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [103]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [104]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [105]:
data = np.random.rand(20)

In [106]:
pd.cut(data, 4, precision=2)

[(0.027, 0.25], (0.48, 0.7], (0.027, 0.25], (0.7, 0.92], (0.25, 0.48], ..., (0.7, 0.92], (0.7, 0.92], (0.027, 0.25], (0.7, 0.92], (0.48, 0.7]]
Length: 20
Categories (4, interval[float64]): [(0.027, 0.25] < (0.25, 0.48] < (0.48, 0.7] < (0.7, 0.92]]

In [107]:
data = np.random.randn(1000)

In [108]:
cats = pd.qcut(data, 4)

In [109]:
cats

[(-3.234, -0.732], (-3.234, -0.732], (-3.234, -0.732], (-0.732, -0.0657], (-3.234, -0.732], ..., (-0.0657, 0.676], (-0.732, -0.0657], (0.676, 2.971], (-0.732, -0.0657], (-0.0657, 0.676]]
Length: 1000
Categories (4, interval[float64]): [(-3.234, -0.732] < (-0.732, -0.0657] < (-0.0657, 0.676] < (0.676, 2.971]]

In [110]:
pd.value_counts(cats)

(0.676, 2.971]       250
(-0.0657, 0.676]     250
(-0.732, -0.0657]    250
(-3.234, -0.732]     250
dtype: int64

In [111]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.259, -0.0657], (-3.234, -1.259], (-1.259, -0.0657], (-1.259, -0.0657], (-1.259, -0.0657], ..., (-0.0657, 1.322], (-1.259, -0.0657], (-0.0657, 1.322], (-1.259, -0.0657], (-0.0657, 1.322]]
Length: 1000
Categories (4, interval[float64]): [(-3.234, -1.259] < (-1.259, -0.0657] < (-0.0657, 1.322] < (1.322, 2.971]]

In [112]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [114]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002577     0.026043    -0.007101     0.025108
std       1.020350     1.042230     1.014290     0.982293
min      -3.338243    -3.213972    -2.833879    -3.133285
25%      -0.673487    -0.707658    -0.694980    -0.629061
50%      -0.016804     0.006993    -0.032416     0.055079
75%       0.691351     0.754723     0.684774     0.659575
max       4.185505     3.554276     2.925677     3.004638

In [115]:
col = data[2]

In [117]:
col[np.abs(col) > 3]

Series([], Name: 2, dtype: float64)

In [118]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
177 -0.177211  3.554276  0.328041  2.115411
227  0.964009 -3.213972 -0.188917  1.259531
285  4.185505  0.209974 -0.217923  1.441267
506  3.397989 -0.529495 -0.803589  0.355402
630 -1.164312  0.307861  0.293211  3.004638
676 -2.539320  1.004562 -1.066213 -3.133285
992 -3.135316  0.103322  0.835657 -0.438236
998 -3.338243  0.697369  0.869527  0.575712

In [119]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [120]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001467     0.025703    -0.007101     0.025236
std       1.013442     1.039853     1.014290     0.981858
min      -3.000000    -3.000000    -2.833879    -3.000000
25%      -0.673487    -0.707658    -0.694980    -0.629061
50%      -0.016804     0.006993    -0.032416     0.055079
75%       0.691351     0.754723     0.684774     0.659575
max       3.000000     3.000000     2.925677     3.000000

In [121]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0  1.0 -1.0 -1.0

In [122]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [123]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [124]:
sampler = np.random.permutation(5)

In [125]:
sampler

array([4, 1, 3, 0, 2])

In [126]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [127]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [128]:
choices = pd.Series([5, 7, -1, 6, 4])

In [129]:
draws = choices.sample(n=10, replace=True)

In [130]:
draws

2   -1
3    6
3    6
0    5
1    7
2   -1
1    7
3    6
2   -1
1    7
dtype: int64

In [131]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                   'data1': range(6)})

In [132]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [133]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [134]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [135]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [136]:
df_with_dummy = df[['data1']].join(dummies)

In [137]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [138]:
mnames = ['movie_id', 'title', 'genres']

In [142]:
movies = pd.read_csv('datasets/movielens/movies.dat', sep='::', header=None, names=mnames, engine='python')

In [144]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [145]:
all_genres = []

In [146]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [147]:
genres = pd.unique(all_genres)

In [148]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [149]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [151]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [153]:
gen = movies.genres[0]

In [154]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [155]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [156]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [157]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [158]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [159]:
np.random.seed(12345)

In [160]:
values = np.random.rand(10)

In [161]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [162]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [163]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [164]:
val = 'a,b,  guido'

In [165]:
val.split(',')

['a', 'b', '  guido']

In [166]:
pieces = [x.strip() for x in val.split(',')]

In [167]:
pieces

['a', 'b', 'guido']

In [168]:
first, second, third = pieces

In [169]:
first + '::' + second + '::' + third

'a::b::guido'

In [170]:
'::'.join(pieces)

'a::b::guido'

In [171]:
'guido' in val

True

In [172]:
val.index(',')

1

In [173]:
val.find(':')

-1

In [175]:
# 请注意find和index的区别在于index在字符串没有找到时会抛出一个异常（而find是返回-1）
# val.index(':')

In [176]:
val.count(',')

2

In [178]:
val

'a,b,  guido'

In [179]:
val.replace(',', '::')

'a::b::  guido'

In [180]:
val.replace(',', '')

'ab  guido'

In [181]:
import re

In [182]:
text = "foo    bar\t baz  \tqux"

In [183]:
text

'foo    bar\t baz  \tqux'

In [184]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [185]:
regex = re.compile('\s+')

In [186]:
regex

re.compile(r'\s+', re.UNICODE)

In [187]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [188]:
regex.findall(text)

['    ', '\t ', '  \t']

In [189]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE使正则表达式不区分大小写
regex = re.compile(pattern, flags=re.IGNORECASE)

In [190]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [191]:
m = regex.search(text)

In [192]:
m

In [193]:
text[m.start():m.end()]

'dave@google.com'

In [194]:
print(regex.match(text))

None

In [195]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [196]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [198]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [199]:
regex

re.compile(r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})',
re.IGNORECASE|re.UNICODE)

In [200]:
m = regex.match('wesm@bright.net')

In [201]:
m.groups()

('wesm', 'bright', 'net')

In [202]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [203]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [204]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [205]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [206]:
data = pd.Series(data)

In [207]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [208]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [209]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [210]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [211]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [212]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [213]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [214]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [215]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [216]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object